In [123]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [124]:
%sql sqlite:///library.db

'Connected: @library.db'

**The following code creates the databases**

In [125]:
%%sql
DROP TABLE IF EXISTS branches;
CREATE TABLE branches (
    branchID int NOT NULL,
    name varchar(250) NOT NULL,
    address varchar(250) NOT NULL,
    PRIMARY KEY (branchID)
);
SET NOCOUNT ON;

 * sqlite:///library.db
Done.
Done.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [126]:
%%sql
DROP TABLE IF EXISTS books;
CREATE TABLE books (
    ISBN int NOT NULL,
    title varchar(250) NOT NULL,
    publisher varchar(250) NOT NULL,
    PRIMARY KEY (ISBN)
);
SET NOCOUNT ON;

 * sqlite:///library.db
Done.
Done.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [127]:
%%sql
DROP TABLE IF EXISTS bookInSystem;
CREATE TABLE bookInSystem (
    bookID int NOT NULL,
    branchID int NOT NULL,
    authorID int NOT NULL,
    ISBN int NOT NULL,
    PRIMARY KEY (bookID),
    FOREIGN KEY (branchID) REFERENCES branches(branchID)
    FOREIGN KEY (authorID) REFERENCES authors(authorID)
    FOREIGN KEY (ISBN) REFERENCES books(ISBN)
);
SET NOCOUNT ON;

 * sqlite:///library.db
Done.
Done.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [128]:
%%sql
DROP TABLE IF EXISTS authors;
CREATE TABLE authors (
    authorID int NOT NULL,
    name varchar(250) NOT NULL,
    PRIMARY KEY (authorID)
);
SET NOCOUNT ON;

 * sqlite:///library.db
Done.
Done.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [129]:
%%sql
DROP TABLE IF EXISTS borrowers;
CREATE TABLE borrowers (
    borrowerID int NOT NULL,
    name varchar(255) NOT NULL,
    address varchar(255),
    phoneNumber int NOT NULL,
    PRIMARY KEY (borrowerID)
);

SET NOCOUNT ON;

 * sqlite:///library.db
Done.
Done.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [130]:
%%sql
DROP TABLE if EXISTS loans;
CREATE TABLE loans (
    loansID int NOT NULL,
    borrowerID int NOT NULL,
    bookID int NOT NULL,
    branchID int NOT NULL,
    date date NOT NULL,
    dueDate date NOT NULL,
    PRIMARY KEY (loansID),
    FOREIGN KEY (borrowerID) REFERENCES borrowers(borrowerID)
    FOREIGN KEY (bookID) REFERENCES bookInSystem(bookID)
    FOREIGN KEY (branchID) REFERENCES branches(branchID)
);
SET NOCOUNT ON;

 * sqlite:///library.db
Done.
Done.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [131]:
%sql PRAGMA table_info(bookInSystem);

 * sqlite:///library.db
Done.

[(0, 'bookID', 'int', 1, None, 1),
 (1, 'branchID', 'int', 1, None, 0),
 (2, 'authorID', 'int', 1, None, 0),
 (3, 'ISBN', 'int', 1, None, 0)]

In [132]:
%sql PRAGMA table_info(branches);

 * sqlite:///library.db
Done.

[(0, 'branchID', 'int', 1, None, 1),
 (1, 'name', 'varchar(250)', 1, None, 0),
 (2, 'address', 'varchar(250)', 1, None, 0)]

In [133]:
%sql PRAGMA table_info(borrowers);

 * sqlite:///library.db
Done.

[(0, 'borrowerID', 'int', 1, None, 1),
 (1, 'name', 'varchar(255)', 1, None, 0),
 (2, 'address', 'varchar(255)', 0, None, 0),
 (3, 'phoneNumber', 'int', 1, None, 0)]

In [134]:
%sql PRAGMA table_info(loans);

 * sqlite:///library.db
Done.

[(0, 'loansID', 'int', 1, None, 1),
 (1, 'borrowerID', 'int', 1, None, 0),
 (2, 'bookID', 'int', 1, None, 0),
 (3, 'branchID', 'int', 1, None, 0),
 (4, 'date', 'date', 1, None, 0),
 (5, 'dueDate', 'date', 1, None, 0)]

In [135]:
%%sql
INSERT INTO branches (branchID, name, address)
VALUES ('11111', 'A1', 'Oslogata'),
('11112', 'A2', 'Alesundgata'),
('11113', 'A3', 'Bergengata'),
('11114', 'A4', 'Altagada'),
('11115', 'A5', 'Moldegata'),
('11116', 'A6', 'Hammerfestgata'),
('11117', 'A7', 'Tromsøgata'),
('11118', 'A8', 'Eidgata'),
('11119', 'A9', 'Trondheimgata'),
('11110', 'A10', 'Stavangergata');
SET NOCOUNT ON;

 * sqlite:///library.db
10 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [136]:
%%sql
INSERT INTO books(ISBN, title, publisher)
VALUES ('755', 'bok1', 'NTNU'),
('567', 'bok2', 'NTNU'),
('357', 'bok3', 'NTNU'),
('367', 'bok4', 'NTNU'),
('742', 'bok5', 'NTNU'),
('236', 'bok6', 'NTNU'),
('945', 'bok7', 'NTNU'),
('684', 'bok8', 'NTNU'),
('326', 'bok9', 'NTNU'),
('197', 'bok10', 'NTNU');
SET NOCOUNT ON;

 * sqlite:///library.db
10 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [137]:
%%sql
INSERT INTO authors(authorID, name)
VALUES('01', 'author1'),
('02', 'author2'),
('03', 'author3'),
('04', 'author4'),
('05', 'author5'),
('06', 'author6'),
('07', 'author7'),
('08', 'author8'),
('09', 'author9'),
('10', 'author10');
SET NOCOUNT ON;

 * sqlite:///library.db
10 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [138]:
%%sql
INSERT INTO bookInSystem (bookID, ISBN, branchID, authorID)
VALUES ('10', '755', '11111', '01'),
('11', '357', '11112', '02'),
('12', '357', '11113', '03'),
('13', '367', '11114', '04'),
('14', '742', '11115', '05'),
('15', '236', '11116', '06'),
('16', '945', '11117', '07'),
('17', '684', '11118', '08'),
('18', '326', '11119', '09'),
('09', '197', '11110', '10'),
('20', '755', '11111', '01');
SET NOCOUNT ON;

 * sqlite:///library.db
11 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [139]:
%%sql
INSERT INTO borrowers (borrowerID, name, address, phoneNumber)
VALUES ('1', 'Sjur', 'Oslo', '46634708'),
('2', 'Mathias', 'Borte', '46634709'),
('3', 'Hans', 'Alta', '46634707'),
('4', 'Michal', 'Stavanger', '46634706'),
('5', 'Per', 'Ålesund', '46634705'),
('6', 'Pål', 'Bergen', '46634704'),
('7', 'Arne', 'Trondheim', '46634703'),
('8', 'Peder', 'Tromsø', '46634702'),
('9', 'Knut', 'Hammerfest', '46634701'),
('10', 'Sebastian', 'Eid', '46634710');
SET NOCOUNT ON;

 * sqlite:///library.db
10 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [140]:
%%sql
INSERT INTO loans (loansID, borrowerID, bookID, branchID, date, dueDate)
VALUES ('123', '1', '09','11111', '2021-02-21', '2021-11-11'),
('111', '2', '10','11111','2021-03-19', '2021-08-19'),
('132', '1', '11','11113','2021-03-19', '2021-11-11'),
('222', '2', '12','11111', '2022-01-01', '2022-06-01'),
('887', '3', '13','11112', '2021-07-09','2021-11-30'),
('877', '5', '14','11114', '2021-07-09','2021-06-10'),
('866', '7', '15','11113', '2021-07-09','2021-12-08'),
('855', '4', '16','11116', '2021-07-09','2021-02-12'),
('844', '8', '17','11119', '2021-07-09','2021-02-26'),
('833', '9', '18','11118', '2021-07-09','2021-12-01');
SET NOCOUNT ON;

 * sqlite:///library.db
10 rows affected.
(sqlite3.OperationalError) near "SET": syntax error
[SQL: SET NOCOUNT ON;]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [141]:
%sql SELECT * FROM branches;

 * sqlite:///library.db
Done.

[(11111, 'A1', 'Oslogata'),
 (11112, 'A2', 'Alesundgata'),
 (11113, 'A3', 'Bergengata'),
 (11114, 'A4', 'Altagada'),
 (11115, 'A5', 'Moldegata'),
 (11116, 'A6', 'Hammerfestgata'),
 (11117, 'A7', 'Tromsøgata'),
 (11118, 'A8', 'Eidgata'),
 (11119, 'A9', 'Trondheimgata'),
 (11110, 'A10', 'Stavangergata')]

In [142]:
%sql SELECT * FROM books

 * sqlite:///library.db
Done.

[(755, 'bok1', 'NTNU'),
 (567, 'bok2', 'NTNU'),
 (357, 'bok3', 'NTNU'),
 (367, 'bok4', 'NTNU'),
 (742, 'bok5', 'NTNU'),
 (236, 'bok6', 'NTNU'),
 (945, 'bok7', 'NTNU'),
 (684, 'bok8', 'NTNU'),
 (326, 'bok9', 'NTNU'),
 (197, 'bok10', 'NTNU')]

In [143]:
%sql SELECT * FROM bookInSystem

 * sqlite:///library.db
Done.

[(10, 11111, 1, 755),
 (11, 11112, 2, 357),
 (12, 11113, 3, 357),
 (13, 11114, 4, 367),
 (14, 11115, 5, 742),
 (15, 11116, 6, 236),
 (16, 11117, 7, 945),
 (17, 11118, 8, 684),
 (18, 11119, 9, 326),
 (9, 11110, 10, 197),
 (20, 11111, 1, 755)]

In [144]:
%sql SELECT * FROM borrowers

 * sqlite:///library.db
Done.

[(1, 'Sjur', 'Oslo', 46634708),
 (2, 'Mathias', 'Borte', 46634709),
 (3, 'Hans', 'Alta', 46634707),
 (4, 'Michal', 'Stavanger', 46634706),
 (5, 'Per', 'Ålesund', 46634705),
 (6, 'Pål', 'Bergen', 46634704),
 (7, 'Arne', 'Trondheim', 46634703),
 (8, 'Peder', 'Tromsø', 46634702),
 (9, 'Knut', 'Hammerfest', 46634701),
 (10, 'Sebastian', 'Eid', 46634710)]

In [145]:
%sql SELECT * FROM loans

 * sqlite:///library.db
Done.

[(123, 1, 9, 11111, '2021-02-21', '2021-11-11'),
 (111, 2, 10, 11111, '2021-03-19', '2021-08-19'),
 (132, 1, 11, 11113, '2021-03-19', '2021-11-11'),
 (222, 2, 12, 11111, '2022-01-01', '2022-06-01'),
 (887, 3, 13, 11112, '2021-07-09', '2021-11-30'),
 (877, 5, 14, 11114, '2021-07-09', '2021-06-10'),
 (866, 7, 15, 11113, '2021-07-09', '2021-12-08'),
 (855, 4, 16, 11116, '2021-07-09', '2021-02-12'),
 (844, 8, 17, 11119, '2021-07-09', '2021-02-26'),
 (833, 9, 18, 11118, '2021-07-09', '2021-12-01')]

**How many copies of the book titled "A" and published by "B" are owned by the library branch whose address is "C"?**

In [146]:
%%sql
SELECT COUNT(*) AS Copies
FROM bookInSystem
INNER JOIN books USING(ISBN)
INNER JOIN branches USING(branchID)
WHERE title = "bok1" AND publisher = 'NTNU' AND address = 'Oslogata';

 * sqlite:///library.db
Done.

[(2,)]

**How many copies of the book titled "A" are owned by each library branch?**

In [153]:
%%sql
SELECT COUNT(*), branches.name
FROM bookInSystem
INNER JOIN books USING(ISBN)
INNER JOIN branches USING(branchID)
WHERE title = "bok1" and bookID IN (
    SELECT bookID
    FROM branches
);

 * sqlite:///library.db
Done.

[(2, 'A1')]

**Retrieve the names of all borrowers who borrowed the book titled "A" for each library branch.**

In [155]:
%%sql
SELECT name
FROM borrowers
INNER JOIN loans USING(borrowerID)
INNER JOIN bookInSystem USING(bookID)
INNER JOIN books USING(ISBN)
WHERE title = "bok1";

 * sqlite:///library.db
Done.

[('Mathias',)]

**For each book that is loaned out from the branch "A" and whose due date is today, retrieve the book title, the borrower's name(s), and the borrower's address(es).**

In [161]:
%%sql
SELECT books.title, borrowers.name, borrowers.address 
FROM bookInSystem
INNER JOIN books USING(ISBN)
INNER JOIN loans USING(bookID)
INNER JOIN borrowers USING(borrowerID)
INNER JOIN branches USING(branchID)
WHERE branches.name = "A10" AND loans.dueDate = "2021-11-11"

 * sqlite:///library.db
Done.

[('bok10', 'Sjur', 'Oslo')]

**For each branch, retrieve the branch name and the total number of books loaded out from that branch.**

In [150]:
%%sql
SELECT branches.name, COUNT(*)
FROM loans, branches
WHERE loans.branchID = branches.branchID
GROUP BY branches.name;

 * sqlite:///library.db
Done.

[('A1', 3), ('A2', 1), ('A3', 2), ('A4', 1), ('A6', 1), ('A8', 1), ('A9', 1)]